In [2]:
import pandas as pd

In [4]:
products = pd.read_csv('C:\\Users\\antoi\\OneDrive\\Bureau\\openclassrooms\\Projet 6\\products.csv', delimiter=',')
transactions = pd.read_csv('C:\\Users\\antoi\\OneDrive\\Bureau\\openclassrooms\\Projet 6\\transactions.csv', delimiter=',')
customers = pd.read_csv('C:\\Users\\antoi\\OneDrive\\Bureau\\openclassrooms\\Projet 6\\customers.csv', delimiter=',')

## products

In [5]:
products.shape

(3287, 3)

In [6]:
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [8]:
products.describe()

             price        categ
count  3287.000000  3287.000000
mean     21.856641     0.370246
std      29.847908     0.615387
min      -1.000000     0.000000
25%       6.990000     0.000000
50%      13.060000     0.000000
75%      22.990000     1.000000
max     300.000000     2.000000

In [10]:
products.nunique()

id_prod    3287
price      1455
categ         3
dtype: int64

In [30]:
valeurs_uniques_products = products['categ'].unique()[:3]

print(valeurs_uniques_products)

[0 1 2]

In [11]:
products.isnull().sum()

id_prod    0
price      0
categ      0
dtype: int64

In [17]:
products.dtypes

id_prod     object
price      float64
categ        int64
dtype: object

## transactions

In [14]:
transactions.shape

(679532, 4)

In [15]:
transactions.isnull().sum()

id_prod       0
date          0
session_id    0
client_id     0
dtype: int64

In [18]:
transactions.dtypes

id_prod       object
date          object
session_id    object
client_id     object
dtype: object

In [20]:
transactions.nunique()

id_prod         3267
date          679371
session_id    342316
client_id       8602
dtype: int64

## customers

In [26]:
print('shape')
print(customers.shape)
print()
print('types')
print(customers.dtypes)

shape
(8623, 3)

types
client_id    object
sex          object
birth         int64
dtype: object

In [27]:
customers.isnull().sum()

client_id    0
sex          0
birth        0
dtype: int64

In [28]:
customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [32]:
valeurs_uniques_customers = customers['sex'].unique()

print(valeurs_uniques_customers)

['f' 'm']

In [33]:
valeurs_uniques_customers = customers['birth'].unique()

print(valeurs_uniques_customers)

[1967 1975 1984 1962 1943 1993 1978 1971 1982 1945 2003 1959 1977 1954
 1987 2000 1992 1963 1958 1994 1936 1986 1942 1970 1957 1968 2002 2004
 1979 1974 1964 1951 1937 1981 1965 1960 1996 1983 1990 1955 1988 1991
 1972 1980 1989 1976 1985 1953 1998 1956 1948 1973 1969 1938 1995 1952
 1949 1999 2001 1939 1950 1966 1935 1941 1961 1997 1944 1929 1947 1946
 1932 1931 1933 1930 1940 1934]

# jointures

## test de type de jointure entre products et transactions

### outer

In [39]:
Test_1 = pd.merge(transactions, products, on='id_prod',how='outer',indicator=True)
Test_1

,id_prod,date,session_id,client_id,price,categ,_merge
0,0_1518,2022-05-20 13:21:29.043970,s_211425,c_103,4.18,0.0,both
1,0_1518,2021-09-26 12:37:29.780414,s_95811,c_6197,4.18,0.0,both
2,0_1518,2021-05-06 17:14:43.117440,s_30782,c_682,4.18,0.0,both
3,0_1518,2022-03-16 18:57:10.420103,s_180057,c_5932,4.18,0.0,both
4,0_1518,2022-11-12 18:58:10.574853,s_296584,c_7217,4.18,0.0,both
...,...,...,...,...,...,...,...
679548,0_1624,NaN,NaN,NaN,24.50,0.0,right_only
679549,2_86,NaN,NaN,NaN,132.36,2.0,right_only
679550,0_299,NaN,NaN,NaN,22.99,0.0,right_only
679551,0_510,NaN,NaN,NaN,23.66,0.0,right_only
679552,0_2308,NaN,NaN,NaN,20.28,0.0,right_only

In [47]:
valeurs_uniques_test_1 = Test_1['_merge'].unique()

print(valeurs_uniques_test_1)

['both', 'left_only', 'right_only']
Categories (3, object): ['left_only', 'right_only', 'both']

In [51]:
Test_1.nunique()

id_prod         3288
date          679371
session_id    342316
client_id       8602
price           1455
categ              3
_merge             3
dtype: int64

### left

In [40]:
Test_2 = pd.merge(transactions, products, on='id_prod', how='left',indicator=True)
Test_2

,id_prod,date,session_id,client_id,price,categ,_merge
0,0_1518,2022-05-20 13:21:29.043970,s_211425,c_103,4.18,0.0,both
1,1_251,2022-02-02 07:55:19.149409,s_158752,c_8534,15.99,1.0,both
2,0_1277,2022-06-18 15:44:33.155329,s_225667,c_6714,7.99,0.0,both
3,2_209,2021-06-24 04:19:29.835891,s_52962,c_6941,69.99,2.0,both
4,0_1509,2023-01-11 08:22:08.194479,s_325227,c_4232,4.99,0.0,both
...,...,...,...,...,...,...,...
679527,0_1551,2022-01-15 13:05:06.246925,s_150195,c_8489,12.99,0.0,both
679528,1_639,2022-03-19 16:03:23.429229,s_181434,c_4370,10.99,1.0,both
679529,0_1425,2022-12-20 04:33:37.584749,s_314704,c_304,12.99,0.0,both
679530,0_1994,2021-07-16 20:36:35.350579,s_63204,c_2227,4.98,0.0,both
679531,1_523,2022-09-28 01:12:01.973763,s_274568,c_3873,23.99,1.0,both

In [46]:
valeurs_uniques_test_2 = Test_2['_merge'].unique()

print(valeurs_uniques_test_2)

['both', 'left_only']
Categories (3, object): ['left_only', 'right_only', 'both']

In [53]:
Test_2.nunique()

id_prod         3267
date          679371
session_id    342316
client_id       8602
price           1443
categ              3
_merge             2
dtype: int64

### right

In [42]:
Test_3 = pd.merge(transactions, products, on='id_prod',how='right',indicator=True)
Test_3

,id_prod,date,session_id,client_id,price,categ,_merge
0,0_1421,2022-02-20 17:04:37.204937,s_168213,c_6389,19.99,0,both
1,0_1421,2022-11-19 03:42:20.707442,s_299590,c_8364,19.99,0,both
2,0_1421,2021-09-19 14:58:46.726179,s_92304,c_3544,19.99,0,both
3,0_1421,2023-01-11 16:04:24.367855,s_325369,c_1025,19.99,0,both
4,0_1421,2021-08-01 19:33:18.877168,s_70071,c_2298,19.99,0,both
...,...,...,...,...,...,...,...
679327,1_140,2022-06-30 11:10:45.544437,s_231391,c_974,38.56,1,both
679328,0_1920,2023-01-30 02:37:22.371278,s_334324,c_7748,25.16,0,both
679329,0_1920,2021-04-13 18:36:10.252971,s_20115,c_7088,25.16,0,both
679330,0_1920,2021-05-30 02:37:22.371278,s_41465,c_7748,25.16,0,both
679331,0_1920,2022-12-30 02:37:22.371278,s_319303,c_7748,25.16,0,both

In [43]:
valeurs_uniques_test_3 = Test_3['_merge'].unique()

print(valeurs_uniques_test_3)

['both', 'right_only']
Categories (3, object): ['left_only', 'right_only', 'both']

In [54]:
Test_3.nunique()

id_prod         3287
date          679150
session_id    342276
client_id       8602
price           1455
categ              3
_merge             2
dtype: int64

## test de type de jointure entre customers et transactions

## left

In [56]:
test_12 = pd.merge(transactions, customers, on='client_id',how='left',indicator=True)
test_12.head()

  id_prod                        date session_id client_id sex  birth _merge
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103   f   1986   both
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534   m   1988   both
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714   f   1968   both
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941   m   2000   both
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232   m   1980   both

In [58]:
valeurs_uniques_test_12 = test_12['_merge'].unique()
print(valeurs_uniques_test_12)

['both']
Categories (3, object): ['left_only', 'right_only', 'both']

In [59]:
test_12.nunique()

id_prod         3267
date          679371
session_id    342316
client_id       8602
sex                2
birth             76
_merge             1
dtype: int64